# AreaBasedLoadBoundaryLineData Properties

---
The AreaBasedLoadBoundaryLineData type exposes the following members.
| Name| Description
---|---|---
| BottomLevelId|  The bottom level id of the area based load boundary line.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| TopLevelId|  The top level id of the area based load boundary line.
Top
#### Reference
AreaBasedLoadBoundaryLineData Class
Autodesk.Revit.DB.Electrical Namespace